#!/bin/bash

curl -X POST http://localhost:8080/reorder \
  -H "Content-Type: application/json" \
  -d '{
    "texts": [
    "同一データベースに対する同一処理は，何度実行しても結果は同じである。き質回果実性もしじ性等とてる何行結べなを同(Idempotent)といすまい。ACIDま接がんれまに含せは特性直、連え性質貫関とま一言す性るすに。",
    "トランザクション完了後にハードウェア障害が発生しても，更新されたデータベースの内容は保証される。性のです続説明永。",
    "トランザクション内の処理は，全てが実行されるか，全てが取り消されるかのいずれかである正しい。性子は原、る可不証うンをる分保シよの特ントすク原すとでに性がで子ザあョこラ。行ザ部シとンンはクなるはさ分れに的ラョトこく実、操すがてる完了のすべか作、まてか戻終すらか作の操ちしに了どべすでがるの元。",
    "一つのトランザクションの処理結果は，他のトランザクション処理の影響を受けない。の性説立明独です。"]}'
