#!/bin/bash

curl -X POST http://localhost:8080/reorder \
     -H "Content-Type: application/json" \
     -d '[{"text": "は、報デ情ーとタリデテパィークデるす散にしタ記分 式をィ各ス方で録すて。1もが障故し台て、りリれクのデデ残さパティス録たにィ記ー っデタてを使ーこ可旧るで能タ復とあを、デー数ク格てをけ納のるめた複ィす分タにデス、時がセアスでに上よクのす特るすみとこすとり徴性が能こ書き同向る読。"}, {"text": "は、数複のRAID5ルグー成プスグをイント構ピラ（RAID 0）しめまてとと、方ス の性を頼すとセア度ク成向速上せで構両信さた。RAID5ではで体全1し台たき故の対にデスしせィん障クでがまでか応、RAID5+0で各はRAID5グルー内でプ1対障がこすィまデで でとのに故る応クスき台すま。また、デーのがたさ散タめら分む進に、性上がクア期きでの待スセ能ます向。"},
     {"text": "各RAID5ルグーきデクにスィつプ1の分パディ台テリー要必なのタがで、RAID5+0量効はの容実、全体のHDDよ台り数RAIDグルーななプ少数すと分量容まけの個いだり。の組二RAID5れであば「－2台分」です。"}]'
